In [1]:
import pandas  as pd
import numpy as np
# import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("xAPI-Edu-Data.csv")
df.head()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,cns,dsa,oops,os
0,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,16.0,2,20
1,M,KW,NaN,lowerlevel,G-04,A,NaN,F,Father,20.0,20.0,3,25
2,M,KW,KuwaIT,NaN,G-04,A,IT,F,Father,10.0,7.0,0,30
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,25.0,5,35
4,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40.0,50.0,12,50

In [3]:
df.shape

(28, 13)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   gender        22 non-null     object
 1   NationalITy   27 non-null     object
 2   PlaceofBirth  23 non-null     object
 3   StageID       26 non-null     object
 4   GradeID       27 non-null     object
 5   SectionID     28 non-null     object
 6   Topic         24 non-null     object
 7   Semester      28 non-null     object
 8   Relation      26 non-null     object
 9   cns           21 non-null     float64
 10  dsa           27 non-null     float64
 11  oops          28 non-null     int64
 12  os            28 non-null     int64
dtypes: float64(2), int64(2), object(9)
memory usage: 3.0+ KB

In [5]:
df.describe()

             cns        dsa       oops         os
count  21.000000  27.000000  28.000000  28.000000
mean   25.571429  26.814815  16.428571  53.392857
std    20.028908  24.334270  13.658340  28.342272
min     0.000000   0.000000   0.000000  11.000000
25%    10.000000  12.000000   3.000000  28.750000
50%    20.000000  19.000000  14.000000  50.000000
75%    36.000000  35.000000  26.250000  80.000000
max    70.000000  88.000000  44.000000  99.000000

In [6]:
df.ndim

2

In [7]:
print(df.isnull().sum())

gender          6
NationalITy     1
PlaceofBirth    5
StageID         2
GradeID         1
SectionID       0
Topic           4
Semester        0
Relation        2
cns             7
dsa             1
oops            0
os              0
dtype: int64

In [8]:
#drop the whole row which having NULL value
df.dropna(inplace=True)
print(df.isnull().sum())
df.shape
#these changes not reflect with your dataset , only change in curr data frame 
#as you again read dataset, NULL are there as before

gender          0
NationalITy     0
PlaceofBirth    0
StageID         0
GradeID         0
SectionID       0
Topic           0
Semester        0
Relation        0
cns             0
dsa             0
oops            0
os              0
dtype: int64

(9, 13)

In [9]:
df = pd.read_csv("xAPI-Edu-Data.csv")
#imputation by mean
df["cns"]=df["cns"].replace(np.NAN,df["cns"].mean())

print(df["cns"])

0     25.571429
1     20.000000
2     10.000000
3     25.571429
4     40.000000
5     42.000000
6     35.000000
7     25.571429
8     12.000000
9     25.571429
10    50.000000
11    19.000000
12     5.000000
13    20.000000
14    25.571429
15    30.000000
16    36.000000
17    25.571429
18    69.000000
19    70.000000
20    25.571429
21    10.000000
22    15.000000
23     2.000000
24     0.000000
25     8.000000
26    19.000000
27    25.000000
Name: cns, dtype: float64

In [10]:
#imputation by median
df = pd.read_csv("xAPI-Edu-Data.csv")
df["cns"]=df["cns"].replace(np.NAN,df["cns"].median())
print(df["cns"])

0     20.0
1     20.0
2     10.0
3     20.0
4     40.0
5     42.0
6     35.0
7     20.0
8     12.0
9     20.0
10    50.0
11    19.0
12     5.0
13    20.0
14    20.0
15    30.0
16    36.0
17    20.0
18    69.0
19    70.0
20    20.0
21    10.0
22    15.0
23     2.0
24     0.0
25     8.0
26    19.0
27    25.0
Name: cns, dtype: float64

In [11]:
#imputation by mode
df = pd.read_csv("xAPI-Edu-Data.csv")
import statistics
df["cns"]=df["cns"].replace(np.NAN,statistics.mode(df["cns"]))
print(df["cns"])

0     20.0
1     20.0
2     10.0
3     20.0
4     40.0
5     42.0
6     35.0
7     20.0
8     12.0
9     20.0
10    50.0
11    19.0
12     5.0
13    20.0
14    20.0
15    30.0
16    36.0
17    20.0
18    69.0
19    70.0
20    20.0
21    10.0
22    15.0
23     2.0
24     0.0
25     8.0
26    19.0
27    25.0
Name: cns, dtype: float64

In [12]:
#imputation by interpolation -linear
df = pd.read_csv("xAPI-Edu-Data.csv")
df["cns"]=df["cns"].interpolate(method='linear',limit_direction='forward',axis=0)
print(df["cns"])

0      NaN
1     20.0
2     10.0
3     25.0
4     40.0
5     42.0
6     35.0
7     23.5
8     12.0
9     31.0
10    50.0
11    19.0
12     5.0
13    20.0
14    25.0
15    30.0
16    36.0
17    52.5
18    69.0
19    70.0
20    40.0
21    10.0
22    15.0
23     2.0
24     0.0
25     8.0
26    19.0
27    25.0
Name: cns, dtype: float64

In [13]:
df = pd.read_csv("xAPI-Edu-Data.csv")
print(df.isnull().sum())
df.shape

gender          6
NationalITy     1
PlaceofBirth    5
StageID         2
GradeID         1
SectionID       0
Topic           4
Semester        0
Relation        2
cns             7
dsa             1
oops            0
os              0
dtype: int64

(28, 13)

In [14]:
#replace categoricl variable with previous value
df = pd.read_csv("xAPI-Edu-Data.csv")
df["gender"]=df["gender"].fillna(method='ffill')
print(df["gender"])

0     NaN
1       M
2       M
3       M
4       M
5       F
6       M
7       M
8       F
9       F
10      M
11      M
12      M
13      M
14      F
15      F
16      F
17      M
18      F
19      F
20      F
21      F
22      M
23      M
24      M
25      M
26      M
27      M
Name: gender, dtype: object

In [15]:
#create the inconsistent data(as any no is not the value for gender)
df1 = pd.read_csv("xAPI-Edu-Data.csv")
df1["gender"]=df1["gender"].fillna(100)
print(df1["gender"])

0     100
1       M
2       M
3       M
4     100
5       F
6       M
7       M
8       F
9       F
10      M
11      M
12      M
13      M
14      F
15      F
16    100
17      M
18      F
19    100
20      F
21      F
22      M
23    100
24      M
25      M
26    100
27      M
Name: gender, dtype: object

In [16]:
#so we replace the inconsistent data with NULL value
cnt=0;
for row in df1["gender"]:
    try:
        int(row)
        df1.loc[cnt,"gender"]=np.nan
    except ValueError:
        pass
    cnt+=1

In [17]:
print(df1["gender"])

0     NaN
1       M
2       M
3       M
4     NaN
5       F
6       M
7       M
8       F
9       F
10      M
11      M
12      M
13      M
14      F
15      F
16    NaN
17      M
18      F
19    NaN
20      F
21      F
22      M
23    NaN
24      M
25      M
26    NaN
27      M
Name: gender, dtype: object